from aiogram import Bot, types
from aiogram.dispatcher import Dispatcher
from aiogram.utils import executor
from aiogram.dispatcher.filters import Text
from googleapiclient.discovery import build
import datetime as dt
from constants import credentials, SAMPLE_SPREADSHEET_ID, SAMPLE_RANGE_NAME

bot = Bot(token='5521890501:AAGzDfRXbsHxgQGeJhVcRJWXmSLstwNxD9c')
dp = Dispatcher(bot)
start_list = ('65', '50', '43', '38', '33', '24', '100', '120',
              '18', '14', '11', '75', '70', '80', '140', '8',
              'кост', 'кост ту', 'бгш27', 'бгш24', 'бгш22',
              'бгш18', 'клсб', 'клгол', 'пк', 'зксб', 'зкгол',
              'Г27', 'Г24', 'Г22', 'ш2х', 'ш27', 'ш24',
              'ш22', 'шзк', 'втзк', 'угон65', 'угон50', 'угон43',
              'шур4', 'шур6', '1р65', '2р65', '1р50', '1р43',
              '1р24', '1р18', 'рс3', 'рс4', 'рс5', 'рс6', 'д65',
              'кд65', 'сд65', 'ск65', 'кб65', 'д50', 'кд50',
              'сд50', 'ск50', 'кб50', 'д43', 'д24', '328',
              '143', '74', '366', '362', '487', '153',
              'клем', 'моно', 'подклем', 'уголок', 'регул',
              'прокладка204', 'крепеж', 'анкер', 'клемма',
              'упорметалл', 'прокладкаупруг', 'скоба', 'шурупЦП54',
              'упорпласт', 'комплектметалл', 'комплектпласт',
              'Мподкладка', 'Дерево1тип', 'Дерево2тип', 'Ш1',
              'Ш3', 'Ш3д', 'шпАРС', 'БрусБ3', 'БрусА4',
              'Ш1 в сборе', 'Ш3 в сборе', 'Ш3д в сборе',
              'шпАРС в сборе', 'прокладка638', 'б27', 'б24',
              'б22', 'б18', 'бг27', 'бг24', 'бг22', 'бг18',
              'дер полушп1', 'дер полушп2', 'кшд23', '2р50',
              'S49', '50острЛотП', '50острПотП', '50острЛотЛ',
              '50острПотП', '65острЛотП', '65острПотП', '65острЛотЛ',
              '65острПотЛ', '50рамаЛотП', '50рамаПотП',
              '50рамаЛотЛ', '50рамаПотЛ', '65рамаЛотП', '65рамаПотП',
              '65рамаЛотЛ', '65рамаПотЛ', '50крест9', '50крест11',
              '50крест7', '50крест4', '65крест9', '65крест11',
              'FosslohSKL12-32', 'метро''50контр9лев', '50контр9прав',
              '50контр11лев', '50контр11прав', '65контр9лев',
              '65контр9прав', '65контр11лев', '65контр11прав',
              '50СП9лев', '50СП9прав', '50СП11лев', '50СП11прав',
              '65СП9лев', '65СП9прав', '65СП11лев', '65СП11прав',
              'СП50рубки9', 'СП50рубки11', 'СП65рубки9', 'СП65рубки11',
              'СП659рубка7994', 'СП659рубка7433', 'СП659рубка7373',
              'СП659рубка6027', 'СП659рубка5912', 'Флюгарка', 'Б24*90',
              'Б24*100', 'Б24*110', 'Б24*120', 'Г24опи',
              'Ш24гровОПИ', 'БСР10*100', 'БСР12*110', 'БСР16*150',
              'БСР20*200', 'БСР22*250', 'БСР24*300', 'ХомутПоворот',
              'ХомутПоворот', 'ХомутБалке', 'ХомутФикс',
              'ХомутСтыкНаружн', 'ХомутСоедУсил', 'ХомутСоед', 'ХомутДоске')
final_data = ''
wtd = {'check': 'Просмотреть наличие',
       'incoming': 'Отметить приход',
       'outgo': 'Отметить расход'}
